{"pages":[{"title":"Криворізький ресурсний центр","text":"Інформація, щодо опису процесу іморту даних від керуючої компанії до розділу \"Житловий фонд\" порталу Криворізький ресурсний центр. Стосується частини в якій буде здійснюватися передача інформація стосовно паспортів будинків, технічних характеристик. Мапа сайту Введеня Перелік довідників Формат файлу","tags":"","url":"index.html"},{"title":"Введення","text":"Розділ &quot;Житловий фонд&quot; Криворізького ресурсного центру передбачає можливість в автоматичному режимі висвітлювати інформацію, щодо висвітлення внутрішнього обліку даних для відвідувачів сайту(абонентів своєї дислокації будинків). Документація v1.0 Документація для розробників. Етап процесу можна розподілити Формування файлу Імпорт файлу через консоль на сайті Файл для передачі даних повинен бути визначеного формату. Тільки за умови дотримання усіх вимог гарантується успішне завантаження даних від керуючих компаній до розділу &quot;Житловий Фонд&quot;.","tags":"","url":"Введення.html"},{"title":"Загальні положення","text":"Table of Contents Перелік файлів у архіві Загальні правила та рекомендації Найчастіші поля, що будуть використовуватися у файлах: Умовні типи даних полів Загальна структура таблиць і реляційних відносин Адресація будинку у системі ТОВ НОВА-КОМ Файл для передачі - це zip-архів. Є певні вимоги для найменування файлу, це необхідно, щоб в майбутньому виключити ситуації імпорту данних до попередніх або майбутніх періодів. Назва повинна задовольняти наступному формату: hpYMSSSS.CFR Параметр Опис hp Тип файлу. Не зміне. Y Номер року. Слід розуміти нумерацію починаючи з 2000 року. Значення вказується у 36-річній системі у верхньому регистрі. H – 2017рік, I – 2018рік, J – 2019рік. M Номер місяця. Також у 36-річній системі у верхньому регистрі. 1 - перший місяць. С - 12 місяць SSSS Серійний номер. Може бути будь якою комбінацією символів [0-9,a..z,Z..Z]. Використовуйте для вашої внутрішньої нумерації файлів. Рекомендуємо передавати кожного разу інкриментально новий номер. CFR Код організації. Назначається кожній керуючій компанії індивідуально один раз і на завжди. Перелік файлів у архіві Файл архіву містить в собі лише файли на першому рівні. Перелік файлів визначено як: Назва файлу Призначення HOUSES.txt Перелік будинків і їх основні параметри HOUSES_ELEMENT_PAR_TYPE0.txt Таблиця параметрів будинку типу рядок HOUSES_ELEMENT_PAR_TYPE1.txt Таблиця параметрів будинку типу десяткових числових значень HOUSES_ELEMENT_PAR_TYPE2.txt Таблиця параметрів будинку типу календарних дат HOUSES_ELEMENT_PAR_TYPE3.txt Таблиця параметрів будинку типу цілих чисел HOUSES_ELEMENT_PAR_TYPE4.txt Таблиця параметрів будинку відносно матеріалів Загальні правила та рекомендації Вміст файлу повинен бути лише в кодуванні cp1251 Кожен файл повинен містити обов’язковий заголовок в якому вказано назва полів та їх типи даних, а також кількість записів. Порядок визначення полів може буди довільним. В загальному виді файли містять інформацію: &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;INTEGER;CHARACTER VARYING\/&gt; &lt;Lengths value=12;8;8;255\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt; Номер рядку Таг Опис 01 Database Службова інформація 02 Codepage Кодова сторінка, завжди повинна бути CP1251 03 Columns Назва полів розділена символом крапка з комою. Порядок послідовності важливий для таг &lt;Datatypes&gt;, &lt;Lengths&gt;, вмісту рядків 04 05 Datatypes Описує типи даних відповідних полів у &lt;Columns&gt;. Їх кількість повинна співпадати з кількістю полів і розміщуються відповідно назві полів рядком вище. 06 Lengths Максимальна довжина знаків для полів. Їх кількість повинна співпадати з кількістю полів і розміщуються відповідно назві полів рядком вище. 07 RecordCount Кількісь рядків з даними, що будуть описані в тегі &lt;DATA&gt;&lt;\/DATA&gt;. В даному рядку замінити символи підкреслення. Всі дані, що містяться між тегами &lt;DATA&gt;&lt;\/DATA&gt; є рядками з даними. Один рядок - це один запис кожне поле в якому розділене символом &quot;|&quot;(пайп) без додаткових пробільних символів. Деякі значення можуть бути відстуні, тобто мати &quot;порожнє&quot; значення. Найчастіші поля, що будуть використовуватися у файлах: Поле Значення CODE_PAR Код параметру будинку. DATE_PAR Дата з якого визначений параметр у будинку. ID_HOUSE Адреса будинку в системі кодуванні ТОВ НОВА-КОМ для однозначного ідентифікування будинку. Умовні типи даних полів Тип (XML) Тип (БД) Опис INTEGER integer Цілі числа. Може мати і від'ємні значення. Зазвичай використовують для вказання кількості, кодів, тощо. CHARACTER char(NN) Строчка фіксованої довжини. CHARACTER VARYING varchar(NN) Строчка будь якої довжини. DOUBLE PRECISION decimal(N,F) Числа з плаваючою крапкою. Зазвичай використовується для вказання сум. DATE varchar(10) Значення дати. Всі поля, в яких описується дата, завжди вказуються у форматі YYYY-MM-DD, де DD - день місяця (1-31), MM - номер місяця (01-12), YYYY - номер року 4 цифри Загальна структура таблиць і реляційних відносин Адресація будинку у системі ТОВ НОВА-КОМ Під адресацію слід розуміти однозначне визначення адреси будинку в межах населеного пункту, що буде відповідати унікальному цифровому ідентифікатру в 12 знаків. Формат ідентифікатору можна описати R SSSS BBB LL KK Поле Позиція Кількість знаків Опис R 1 1 Зарезервовано завжди вказувати &quot;1&quot; SSSS 2..5 4 Код вулиці у довіднику. Довідник можливо отримати по запиту. BBB 6..8 3 Номер будинку. LL 9..10 2 Літера будинку. У більшості випадків &quot;000&quot;, для будинків, що не мають літери. Якщо будинок має літеру, то номер - це відповідний індекс літери. Визначені наступні індекси: 0=&gt;'', 1=&gt;'А', 2=&gt;'Б', 3=&gt;'В', 4=&gt;'Г', 5=&gt;'Д', 6=&gt;'Е', 7=&gt;'Ж', 8=&gt;'З', 9=&gt;'И', 10=&gt;'К', 11=&gt;'Л', 12=&gt;'М', 13=&gt;'Н', 14=&gt;'О', 15=&gt;'П', 16=&gt;'Р', 17=&gt;'С', 18=&gt;'Т', 19=&gt;'У', 20=&gt;'Ф', 21=&gt;'Х', 22=&gt;'Ц', 23=&gt;'Ч', 24=&gt;'Ш', 25=&gt;'Щ', 26=&gt;'Ю', 27=&gt;'Я', 28=&gt;'І' KK 11..12 2 Номер корпусу. У більшості випадків &quot;00&quot;, коли немає корпусу. Всі поля у разі, якщо вони мають меншу кількість знаків необхідно доповнювати нулями зліва. Декілька прикладів адресації будинків: 100770260000 вулиця Армавірська буд. 26 103960460100 вулиця Героїв АТО буд. 46А 102060430001 вулиця Ватутіна буд. 43\/1 106610620600 вулиця Свято-Миколаївська буд. 62Е","tags":"","url":"Формат_файлу\/Загальні_положення.html"},{"title":"Таблиця HOUSES","text":"Вказана таблиця(файл) описує будинки в дислокації керуючої компаній будинку. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. NFLOORS √ integer Кількість поверхів у будинку CODE_REG integer Код адміністративного району. ID_OPER integer Код оператора. CHECKED integer ЗАПИТАТИ У ЛОПАТІНА ???? CODE_HOUSE_TYPE √ integer Код класифікації будинку у довіднику CODE_ZONE integer Код дільниці довіднику дільниць керуючої компанії Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE Зміст Таблиця містить інформацію про декілька основних характеристик будинку, дислокацію по відношеню до керуючої компаній, а також розміщення в адміністративному районі міста. Посилається на таблиці Довідник класифікації будинків Довідник дільниць керуючої компанії Має посилання з таблиць Таблиця параметрів будинку типу рядок Таблиця параметрів будинку типу десяткових числових значень Таблиця параметрів будинку типу календарних дат Таблиця параметрів будинку типу цілих чисел Таблиця параметрів будинку відносно матеріалів Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;NFLOORS;CODE_REG;ID_OPER;CHECKED;CODE_HOUSE_TYPE;CODE_ZONE\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;INTEGER;INTEGER;INTEGER;INTEGER;INTEGER\/&gt; &lt;Lengths value=12;8;8;8;8;8;8\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES.html"},{"title":"Таблиця HOUSES ELEMENT PAR TYPE0","text":"Таблиця описує параметрів будинку типу рядок. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. CODE_PAR √ integer Код параметра будинку із довідника параметрів будинку. VALUE_FPARM varchar(50) Значення параметру. DATE_PAR √ date Дата з якого дії параметр. ID_OPER integer Код оператора. DATE_COR date Дата модифікації. Майже завжди повинен співпадати з полем DATE_PAR. Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE, CODE_PAR, DATE_PAR Зміст Таблиця описує параметри будинків, ті що визначені як типа даних – рядок. Посилається на таблиці Перелік будинків і їх основні параметри Довідника параметрів будинку. Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;VALUE_FPARM;DATE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;CHARACTER;DATE;INTEGER;DATE\/&gt; &lt;Lengths value=12;8;50;10;8;10\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES_ELEMENT_PAR_TYPE0.html"},{"title":"Таблиця HOUSES ELEMENT PAR TYPE1","text":"Таблиця описує параметрів будинку типу десяткових числових значень. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. CODE_PAR √ integer Код параметра будинку із довідника параметрів будинку. VALUE_FPARM decimal(15,3) Значення параметру. Максимальна розрядність дробної частини – 3 знаки. DATE_PAR √ date Дата з якого дії параметр. ID_OPER integer Код оператора. DATE_COR date Дата модифікації. Майже завжди повинен співпадати з полем DATE_PAR. Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE, CODE_PAR, DATE_PAR Зміст Таблиця описує параметри будинків, ті що визначені як типа даних – десяткові числа із плаваючою комою. Посилається на таблиці Перелік будинків і їх основні параметри Довідника параметрів будинку. Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;VALUE_FPARM;DATE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;DOUBLE PRECISION;DATE;INTEGER;DATE\/&gt; &lt;Lengths value=12;8;18;10;8;10\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES_ELEMENT_PAR_TYPE1.html"},{"title":"Таблиця HOUSES ELEMENT PAR TYPE2","text":"Таблиця описує параметрів будинку типу календарних дат. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. CODE_PAR √ integer Код параметра будинку із довідника параметрів будинку. DATE_PAR √ date Дата з якого дії параметр. ID_OPER integer Код оператора. DATE_COR date Дата модифікації. Майже завжди повинен співпадати з полем DATE_PAR. Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE, CODE_PAR, DATE_PAR Зміст Таблиця описує параметри будинків, ті що визначені як типа даних – календарні дати. Наприклад, це відноситься до понять – дати встановлення, дати повірки, тощо. Посилається на таблиці Перелік будинків і їх основні параметри Довідника параметрів будинку. Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;DATE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;DATE;INTEGER;DATE\/&gt; &lt;Lengths value=12;8;10;8;10\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES_ELEMENT_PAR_TYPE2.html"},{"title":"Таблиця HOUSES ELEMENT PAR TYPE3","text":"Таблиця описує параметрів будинку типу цілих чисел. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. CODE_PAR √ integer Код параметра будинку із довідника параметрів будинку. VALUE_FPARM integer Значення параметру. DATE_PAR √ date Дата з якого дії параметр. ID_OPER integer Код оператора. DATE_COR date Дата модифікації. Майже завжди повинен співпадати з полем DATE_PAR. Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE, CODE_PAR, DATE_PAR Зміст Таблиця описує параметри будинків, ті що визначені як типа даних – цілі числа. Посилається на таблиці Перелік будинків і їх основні параметри Довідника параметрів будинку. Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;VALUE_FPARM;DATE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;INTEGER;DATE;INTEGER;DATE\/&gt; &lt;Lengths value=12;8;8;10;8;10\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES_ELEMENT_PAR_TYPE3.html"},{"title":"Таблиця HOUSES ELEMENT PAR TYPE4","text":"Таблиця описує параметрів будинку із зазначенням використаних матеріалів. Структура Поле Обов’язкове Тип данних Опис ID_HOUSE √ char(12) Ідентифікатор будинку. CODE_PAR √ integer Код параметра будинку із довідника параметрів будинку. CODE_MATERIAL √ integer Код матеріалу із довідника матеріалів, що використовується у параметраїх будинку DATE_PAR √ date Дата з якого дії параметр. ID_OPER integer Код оператора. DATE_COR date Дата модифікації. Майже завжди повинен співпадати з полем DATE_PAR. Ключі для збереження цілосності бази даних: первинний ключ = ID_HOUSE, CODE_PAR, DATE_PAR Зміст Таблиця описує використані матеріали по відношеню до параметрів будинку. Посилається на таблиці Перелік будинків і їх основні параметри Довідника параметрів будинку. Довідник матеріалів, що використовується у параметраїх будинку Шаблон файлу &lt;Database value=IB\/&gt; &lt;Codepage value=CP1251\/&gt; &lt;Columns value=ID_HOUSE;CODE_PAR;CODE_MATERIAL;DATE_PAR;ID_OPER;DATE_COR\/&gt; &lt;Datatypes value=CHARACTER;INTEGER;INTEGER;DATE;INTEGER;DATE\/&gt; &lt;Lengths value=12;8;8;10;8;10\/&gt; &lt;RecordCount value=___\/&gt; &lt;DATA&gt; ... &lt;\/DATA&gt;","tags":"","url":"Формат_файлу\/Таблиця_HOUSES_ELEMENT_PAR_TYPE4.html"},{"title":"Перелік довідників","text":"Для функціонування структури паспорту будинку визначіне довідники. Дані в довідниках змінює лише розробник ресурсного центру. Перелік задіяних довідників Назва Призначення JKK_G_ZONE Визначення дільниць керуючої компанії JKK_G_HOUSE_TYPE Довідник класифікації будинків JKK_G_HOUSES_ELEMENT Довідник категорій параметрів будинку JKK_G_HOUSES_ELEMENT_PAR Довідник параметрів будинку JKK_G_ELEMENT_PAR_MATERIAL Довідник матеріалів, що використовується у параметраїх будинку","tags":"","url":"Загальні_довідники\/Перелік_довідників.html"},{"title":"Довідник JKK G ZONE","text":"Вказана таблиця(файл) є довідником дільниць керуючих компаній. Структура Поле Тип данних Опис CODE_ZONE integer Код дільниці. CODE_FIRME integer Код організації. CODE_BRANCH integer Код підрозділу в межах функціоналу ресурсного центру Ключі для збереження цілосності бази даних: первинний ключ = CODE_ZONE Зміст Таблиця містить інформацію про дільниці і їх зв'язок із керуючою компаніює. Керує довідником одноосібно розробники ресурсного центру. В основному розповсюджена ситуація для невеликих керуючих команій – одна дільниця одна керуюча компанія. Має посилання з таблиць Перелік будинків і їх основні параметри","tags":"","url":"Загальні_довідники\/Довідник_JKK_G_ZONE.html"},{"title":"Довідник JKK G HOUSE TYPE","text":"Вказана таблиця(файл) є довідником класифікації будинків. Структура Поле Тип данних Опис CODE_HOUSE_TYPE integer Код класифікації. NAME_HOUSE_TYPE varchar(30) Найменування класифікації. Ключі для збереження цілосності бази даних: первинний ключ = CODE_HOUSE_TYPE Зміст Таблиця містить інформацію про класифікацію будинків. Має посилання з таблиць Перелік будинків і їх основні параметри Дані станом на березень 2019 року code_house_type name_house_type 1 Багатоквартирий(панельний) 2 Багатоквартирний(не панельний) 3 Котедж 4 Приватний 5 Не житлова споруда","tags":"","url":"Загальні_довідники\/Довідник_JKK_G_HOUSE_TYPE.html"},{"title":"Довідник JKK G HOUSES ELEMENT","text":"Вказана таблиця(файл) є довідником категорій параметрів у будинках. Структура Поле Тип данних Опис CODE_ELEMENT integer Код категорії параметрів. NAME_ELEMENT varchar(50) Назва категорії. TAB integer Код закладки для відобреження в ресурсному центрі. Ключі для збереження цілосності бази даних: первинний ключ = CODE_ELEMENT Зміст Таблиця містить інформацію про категорії параметрів. Тобто всі параметри із таблиці Довідник параметрів будинку буду погруповані. TAB визначає розміщення в категорії по закладам, на сторінці будинку в ресурсному центрі розділу Житловий фонд. На даний час для зручності користувачів визначено наступне: 0 – Характеристики 1 – Складові 2 – Обладнання 3 – Територія Має посилання з таблиць Довідник параметрів будинку Дані станом на березень 2019 року code_element name_element tab 1 Характеристики будинку 0 2 Фундамент 1 3 Підвал 1 4 Несучі стіни 1 5 Перекриття 1 6 Внутрішні перегородки 1 7 Вбудовані нежитлові приміщення 1 8 Сходові клітини 1 9 Вікна на сходовіх клітинах 2 10 Ліфти 2 11 Технічний поверх 1 12 Горище 1 13 Покрівля 1 14 Фасад 1 15 Димови канали 2 16 Вентиляційні канали 2 17 Протипожежна автоматика 2 18 Сміттєпроводи 2 19 Місця для конс'єржів 2 20 Прибудинкова територія 3 21 Ганки 3 22 Дитячий майданчик 3 23 Спортивний майданчик 3 24 Господарчій майданчик 3 25 Майданчик для відпочинку 3 26 Стоянка для автотранспорту 3 27 Холодне водопостачання 2 28 Водовідведення 2 29 Гаряче водопостачання 2 30 Опалення 2 31 Лічильник холодного водопостачання на будинок 2 32 Лічильник гарячого водопостачання на будинок 2 33 Лічильник теплової енергії на будинок 2 34 Електрообладнання 2 35 Газове господарство 2","tags":"","url":"Загальні_довідники\/Довідник_JKK_G_HOUSES_ELEMENT.html"},{"title":"Довідник JKK G HOUSES ELEMENT PAR","text":"Вказана таблиця(файл) є довідником параметрів будинку. Структура Поле Тип данних Опис CODE_PAR integer Код параметра будинку. NAME_PAR varchar(50) Назва параметру будинку. CODE_ELEMENT integer Код категорії параметрів у довіднику категорій параметрів будинку MEASURE_PAR varchar(5) Текстове скорочення одиниць виміру. TYPE_PAR integer Зарезервоване поле. Наразі не актуальне. IS_SP integer Зарезервоване поле. ORDER_NUM integer Порядок розміщення поміж інших елементів в межах категорії. Пріорітет від меншого до більшого. Ключі для збереження цілосності бази даних: первинний ключ = CODE_PAR унікальний індекс = CODE_PAR, CODE_ELEMENT Зміст Таблиця містить дані про усі можливі параметри будинку. Посилається на таблиці Довідник категорій параметрів будинку Має посилання з таблиць Таблиця параметрів будинку типу рядок Таблиця параметрів будинку типу десяткових числових значень Таблиця параметрів будинку типу календарних дат Таблиця параметрів будинку типу цілих чисел Таблиця параметрів будинку відносно матеріалів Дані станом на березень 2019 року code_par name_par code_element measure_par type_par is_sp ordernum 1 Серія будинку 1 0 0 100 2 Форма власності 1 4 1 200 3 Рік введення в експлуатацію 1 3 1 300 4 Технічний стан 1 6 0 400 5 Кількість поверхів (низька секція) 1 3 1 500 6 Кількість поверхів (висока секція) 1 3 1 600 7 Кількість під'їздів 1 шт 3 0 700 8 Кількість домофонів 1 3 0 800 9 Кількість квартир 1 3 1 900 10 Кількість квартир, що перебувають у приватній власності 1 3 1 1000 11 Кількість квартир, що перебувають у комунальній власності 1 3 1 1100 12 кількість квартир, виведених із житлового у нежитловий фонд 1 3 1 1520 13 Загальна площа квартир будинку, в тому числі: 1 м2 1 1 1300 14 Житлова площа у квартирах будинку 1 м2 1 1 1400 15 Площа нежитлових приміщень у квартирах будинку 1 м2 1 1 1500 16 Загальна площа квартир першого поверху (для будинків, обладнаних ліфтами) 1 м2 1 1 1600 17 Балансова вартість будинку 1 грн 1 1 1700 18 Кількість зареєстрованих мешканців 1 3 1 1800 19 Цокольний поверх 1 5 0 1900 20 Чи елітний будинок 1 5 0 2000 21 Технічний стан 2 6 0 2100 22 Тип фундаменту 2 4 0 2200 23 Матеріал фундаменту 2 4 0 2300 24 Чи існує 3 5 1 2400 25 Площа 3 м2 1 1 2500 26 Технічний стан 4 6 0 2600 27 Матеріал зовнішніх стін 4 4 1 2700 28 Товщина 4 мм 1 0 2800 29 Матеріал внутрішніх стін 4 4 0 2900 30 Товщина 4 мм 1 0 3000 31 Технічний стан 5 6 0 3100 32 Матеріал 5 4 0 3200 33 Матеріал 6 4 0 3300 34 Товщина 6 мм 1 0 3400 35 Чи існує 7 5 1 3500 36 Технічний стан 7 6 0 3600 37 Площа 7 м2 1 1 3700 38 Площа приватизованих приміщень 7 м2 1 0 3800 39 Площа орендованих приміщень 7 м2 1 0 3900 40 Технічний стан 8 6 0 4000 41 Площа 8 м2 1 1 4100 42 Потребує ремонту 8 м2 1 0 4200 43 Технічний стан 9 6 0 4300 44 Кількість 9 шт 3 0 4400 45 Площа 9 м2 1 0 4500 46 Матеріал 9 4 0 4600 47 Чи існує 10 5 0 4700 48 Технічний стан 10 6 0 4800 49 Кількість 10 шт 3 0 4900 50 Дата встановлення 10 2 0 5000 51 Дата модернизації (заміни, капітального ремонту) 10 2 0 5100 52 Чи існує 11 5 0 5200 53 Технічний стан 11 6 0 5300 54 Площа 11 м2 1 0 5400 55 Чи існує 12 5 1 5500 56 Технічний стан 12 6 0 5600 57 Площа 12 м2 1 1 5700 58 Технічний стан 13 6 0 5800 59 Площа 13 м2 1 1 5900 60 Тип 13 4 0 6000 61 Матеріал 13 4 1 6100 62 Дата капітального ремонту 13 2 0 6200 63 Потребує ремонту 13 м2 1 0 6300 64 Технічний стан 14 6 0 6400 65 Площа 14 м2 1 1 6500 66 Дата капітального ремонту 14 2 0 6600 67 Потребує ремонту 14 м2 1 0 6700 68 Технічний стан оголовків 15 6 0 6800 69 Кількість 15 шт 3 1 6900 70 Кількість 16 шт 3 1 7000 71 Технічний стан 17 6 0 7100 72 Кількість 17 шт 3 1 7200 73 Технічний стан 18 6 0 7300 74 Кількість 18 шт 3 1 7400 75 Чи існує 19 5 0 7500 76 Кількість місць 19 шт 3 0 7600 77 Кількість конс'єржів 19 3 0 7700 78 Технічна можливість устаткування 19 5 0 7800 79 Площа 20 м2 1 1 7900 80 Площа без покриття 20 м2 1 1 8000 81 Площа асфальтованого покриття двору 20 м2 1 1 8100 82 Площа газонів двору 20 м2 1 1 8200 83 Потребує відновлення асфальтове покриття 20 м2 1 0 8300 84 Чи існує 21 5 0 8400 85 Технічний стан 21 6 0 8500 86 Чи існує 22 5 0 8600 87 Технічний стан 22 6 0 8700 88 Кількість 22 шт 3 0 8800 89 Площа 22 м2 1 0 8900 90 Чи існує 23 5 0 9000 91 Технічний стан 23 6 0 9100 92 Кількість 23 шт 3 0 9200 93 Площа 23 м2 1 0 9300 94 Чи існує 24 5 0 9400 95 Технічний стан 24 6 0 9500 96 Кількість 24 шт 3 0 9600 97 Площа 24 м2 1 0 9700 98 Чи існує 25 5 0 9800 99 Технічний стан 25 6 0 9900 100 Кількість 25 шт 3 0 10000 101 Площа 25 м2 1 0 10100 102 Чи існує 26 5 0 10200 103 Технічний стан 26 6 0 10300 104 Кількість 26 шт 3 0 10400 105 Площа 26 м2 1 0 10500 106 Технічна можливість устаткування 26 5 0 10600 107 Чи існує 27 5 1 10700 108 Джерело 27 4 1 10800 109 Технічний стан 27 6 0 10900 110 Кількість дворових колонок 27 3 1 11000 111 Кількість стояків 27 шт 3 1 11100 112 Довжина стояків 27 м 1 0 11200 113 Довжина у подвалі, горищі і т.і. 27 м 1 0 11300 114 Дата капітального ремонту 27 2 0 11400 115 Потребує заміни 27 м 1 0 11500 116 Тип водовідведення 28 4 1 11600 117 Кількість дворвих туалетів 28 шт 3 1 11700 118 Довжина внутрішньобудинкових комунікацій 28 м 1 1 11800 119 Технічний стан 28 6 0 11900 120 Дата капітального ремонту підвальної розводки 28 2 0 12000 121 Потребує заміни 28 м 1 0 12100 122 Чи існує 29 5 1 12200 123 Технічний стан 29 6 0 12300 124 Джерело 29 4 1 12400 125 Кількість стояків 29 шт 3 1 12500 126 Довжина стояків 29 м 1 0 12600 127 Довжина у подвалі, горищі і т.і. 29 м 1 0 12700 128 Дата капітального ремонту 29 2 0 12800 129 Потребує заміни 29 м 1 0 12900 130 Чи існує 30 5 1 13000 131 Технічний стан 30 6 0 13100 132 Джерело 30 4 1 13200 133 Кількість стояків 30 шт 3 1 13300 134 Довжина стояків 30 м 1 0 13400 135 Довжина у подвалі, горищі і т.і. 30 м 1 0 13500 136 Дата капітального ремонту 30 2 0 13600 137 Потребує заміни 30 м 1 0 13700 138 Чи існує 31 5 0 13800 139 Кількість 31 шт 3 0 13900 140 Дата встановлення 31 2 0 14000 141 Дата повірки 31 2 0 14100 142 Чи існує 32 5 0 14200 143 Кількість 32 шт 3 0 14300 144 Дата встановлення 32 2 0 14400 145 Дата повірки 32 2 0 14500 146 Чи існує 33 5 0 14600 147 Кількість 33 шт 3 0 14700 148 Дата встановлення 33 2 0 14800 149 Дата повірки 33 2 0 14900 150 Технічний стан 34 6 0 15000 151 Тип проводки 34 4 1 15100 152 Кількість щитових 34 3 1 15200 153 Дата капітального ремонту 34 2 0 15300 154 Кількість автоматів захисту 34 3 0 15400 155 Встановлено електроплити 34 5 1 15500 156 Кількість електроплит 34 шт 3 1 15600 157 Чи існує 35 5 1 15700 158 Технічний стан 35 6 0 15800 159 Наявність газових плит 35 5 1 15900 160 Кількість газових плит 35 шт 3 1 16000 161 Кількість газових колонок 35 шт 3 0 16100 162 Довжина фасадного газопроводу 35 м 1 0 16200 163 Тип будинку 1 7 0 16300 164 площа квартир, виведених із житлового у нежитловий фонд 1 м2 1 1 1510 165 Площа асфальтованого покриття вулиці 20 м2 1 1 8110 166 Площа газонів вулиці 20 м2 1 1 8210 167 Площа нежитлових приміщень будинку: 1 м2 1 1 1505 168 Площа допоміжних приміщень будинку 1 м2 1 1 1550","tags":"","url":"Загальні_довідники\/Довідник_JKK_G_HOUSES_ELEMENT_PAR.html"},{"title":"Довідник JKK G ELEMENT PAR MATERIAL","text":"Вказана таблиця(файл) є довідником матеріалів відносно параметрів будинку. Структура Поле Тип данних Опис CODE_MATERIAL integer Код матеріалу. NAME_MATERIAL varchar(50) Найменування матеріалу. CODE_PAR integer Код параметру будинку довіднику параметрів будинку. Ключі для збереження цілосності бази даних: первинний ключ = CODE_MATERIAL унікальний індекс = CODE_MATERIAL, CODE_PAR Зміст Таблиця описує матеріали, що використані у параметрах будинку. Має посилання з таблиць Таблиця параметрів будинку відносно матеріалів Дані станом на березень 2019 року code_material name_material code_par 1 Державна 2 2 Комунальна 2 3 Приватна 2 4 Свайний 22 5 Суцільний 22 6 Стрічковий 22 7 Стовпчастий 22 8 Залізобетонні сваи 23 9 Залізобетонні блоки 23 10 Камінь 23 11 Залізобетонні панелі 27 12 Цегла 27 13 Гіпсоблоки 27 14 Глинобитні обкладені цеглою та ін. 27 15 Дерево 27 16 ян. цегла 27 17 Дощаті 27 18 Дощаті. цегла 27 19 Залізобітонний моноліт 27 20 Залізобетонні блоки 27 21 Залізобетонні панелі 27 22 Камінь 27 23 Каркасно-щитові 27 24 Каркасні 27 25 Керамзитобетонні блоки 27 26 Панелі 27 27 Ракушняк 27 28 Саман 27 29 Цегляні з малих блоків 27 30 Шлакоблок 27 31 Щитові 27 32 Щитові штукат. 27 33 Щитові. цегла 27 34 Залізобетонні панелі 29 35 Цегла 29 36 Гіпсоблоки 29 37 Глинобитні обкладені цеглою та ін. 29 38 Дерево 29 39 ян. цегла 29 40 Дощаті 29 41 Дощаті. цегла 29 42 Залізобітонний моноліт 29 43 Залізобетонні блоки 29 44 Залізобетонні панелі 29 45 Камінь 29 46 Каркасно-щитові 29 47 Каркасні 29 48 Керамзитобетонні блоки 29 49 Панелі 29 50 Ракушняк 29 51 Саман 29 52 Цегляні з малих блоків 29 53 Шлакоблок 29 54 Щитові 29 55 Щитові штукат. 29 56 Щитові. цегла 29 57 Залізобетонні панелі 32 58 Дерево 32 59 Залізобітонний моноліт 32 60 Залізо-бетонні панелі 33 61 Цегла 33 62 Гіпсоблоки 33 63 Глинобитні обкладені цеглою та ін. 33 64 Дерево 33 65 ян. цегла 33 66 Дощаті 33 67 Дощаті. цегла 33 68 Залізобітонний моноліт 33 69 Залізобетонні блоки 33 70 Залізобетонні панелі 33 71 Камінь 33 72 Каркасно-щитові 33 73 Каркасні 33 74 Керамзитобетонні блоки 33 75 Панелі 33 76 Ракушняк 33 77 Саман 33 78 Цегляні з малих блоків 33 79 Шлакоблок 33 80 Щитові 33 81 Щитові штукат. 33 82 Щитові. цегла 33 83 Дерево 46 84 Металопластик 46 85 яка 60 86 Тверда 60 87 які покрівельні матеріали 61 88 Шифер (черепиця. інше) 61 89 Оцинкована сталь 61 90 Чорна покрівельна сталь 61 91 Центральне 108 92 Дворова колонка 108 93 Криниця 108 94 Центральна 116 95 Місцева 116 96 Вигребна яма 116 97 Центральне (ТЕЦ) 124 98 Газова колонка 124 99 Індивідуальний бойлер 124 100 Будинковий котел 124 101 Центральне (ТЕЦ) 132 102 Центральне (будинкова котельня) 132 103 АГВ (Котли) 132 104 Пічне 132 105 Закрита 151 106 Відкрита 151 107 Залізобетонні плити 61 108 Співвласність 2","tags":"","url":"Загальні_довідники\/Довідник_JKK_G_ELEMENT_PAR_MATERIAL.html"},{"title":"Імпорт файлу","text":"Процес імпорту в загальному вигляді полягає в тому, що представник управителя повинен зайти на сайт ресурсного центру, та у розділі &quot;Житловий фонд&quot; відвантажив файл. Table of Contents Етап 1 та 2 (увійти на ресурсний центр) Етап 3 (перейти до форму відвантаження файлу) Етап 4 (виконати імпорт файлу) Етап 5 (стан виконання імпорту) Етап 1 та 2 (увійти на ресурсний центр) Зайти на сайт під своїм логіном. Логін видають модератори Криворізького ресурсного центру. Посилання: https:\/\/krmisto.gov.ua\/ua\/site\/login.html Етап 3 (перейти до форму відвантаження файлу) Перейти до сторінки &quot;Імпорт паспортів будинків (h)&quot; Посилання: https:\/\/krmisto.gov.ua\/ua\/komgosp\/manage\/h_files.html Етап 4 (виконати імпорт файлу) У формі вкажіть файл для імпорту та розпочніть процес імпорту - кнопка &quot;розпочати імпорт даних&quot; Етап 5 (стан виконання імпорту) Процес імпорту може займати від декількох секунд до декілької хвилин. Тому поетапно буде висвітлено інформацію, яка завантажується із файлу. У випадку коли процес виявить помилку, то імпорт зупиниться і буде опубліковано повідомлення про помилку (червоним кольором).","tags":"","url":"Імпорт_файлу.html"},{"title":"Повідомити про помилку","text":"Table of Contents Якщо знайшли помилку або маєте пропозиції щодо покращення документації, то просимо вас повідомити: GitHub issue на електрону пошту novakom.devel@gmail.com завести заявку у центрі звернень криворізького русерсного центру тільки для зареєстрованих користувачів","tags":"","url":"Повідомити_про_помилку.html"}]}